# Задача 32: Определить индексы элементов массива (списка),
#  значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]

list1=[-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

min1=int(input("введите минимум: "))
max1=int(input("введите максимум: "))
newList=[]

for i in range(len(list1)):
    if list1[i]>min1 and list1[i]<max1: 
        newList.append(i)

print(newList)
